fun main() {


    // 3 0 1 9 7 8 2 5 4 6
// 회원관리 프로그램 만들기

//    회원 수 : 2[엔터]
//    = 2명의 회원 정보를 입력합니다. =
//    1번째 회원의 이름 : 홍길동[엔터]
//    1번째 회원의 나이 : 22[엔터]
//    1번째 회원의 성별(M/W) : m[엔터]
//    1번 회원의 정보가 등록되었습니다.
//    2번째 회원의 이름 : 홍길순[엔터]
//    2번째 회원의 나이 : 23[엔터]
//    2번째 회원의 성별(M/W) : w[엔터]
//    2번 회원의 정보가 등록되었습니다.
//    = 입력하신 회원 리스트 =
//        번호 / 이름  / 나이 / 성별
//    1   / 홍길동 / 22  / 남자
//    2   / 홍길순 / 23  / 여자

    // 부가 기능
    // 1) 나이의 오름차순 정렬
    // 2) 나이의 내림차순 정렬
    // >> 이미 저장된 회원의 정보(id순)는 유지하도록,
    //    clone한 다른 하나의 배열에 나이의 오름차순으로 따로 정렬/저장하였음.
    // clone한 배열을 나이의 오름차순으로 정렬된 배열로 만드는 함수(1회만 실행하면 됨), 그대로 호출하는(오름차순) 함수,
    // 내림차순으로 호출하는 함수를 만드는 게 베스트이지만 연습을 위해서 내림차순으로 저장하는 함수도 만듦.
    println("=== 프로그램 시작 ===")

    println("=== 프로그램 종료 ===")
    
    
    

}
